AlmAck/nuttx/arch/arm/src/da1470x/da1470x_gpu.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_gpu.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Native driver for the DA1470x 2D GPU (a TES D/AVE 2D core) operated in
 * register mode: the CPU programs the geometry, colour and frame buffer
 * registers and the write to D2_ORIGIN starts the render.  Completion is
 * signalled by the "enumeration finished" interrupt.  Two primitives are
 * offered: an axis-aligned solid fill (no limiters, the bounding box is
 * the rectangle) and a rectangle copy through the texture unit.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/clock.h>
#include <nuttx/fs/fs.h>

#include "arm_internal.h"
#include "hardware/da1470x_gpu_core.h"
#include "hardware/da1470x_gpu_reg.h"
#include "hardware/da1470x_crg_gpu.h"
#include "hardware/da1470x_cache.h"
#include "da1470x_gpu.h"
#include "da1470x_pmu.h"

#ifdef CONFIG_DA1470X_GPU

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GPU_TIMEOUT_MS          100

/* The core is an AHB master without the CPU's address remapping and
 * without the flash cache in its path.  The CPU sees the firmware image
 * at address 0; physically it lies in the flash at the region base plus
 * the region offset the boot ROM programmed into CACHE_FLASH_REG (the
 * image does not start at the beginning of the flash), and the GPU
 * reaches the flash through the controller's second window, 0x20000000
 * above the first.
 */

#define GPU_FLASH_CPU_WINDOW    0x08000000
#define GPU_FLASH_BUS_OFFSET    0x20000000
#define GPU_IDLE_LOOPS          1000000

#define GPU_BUSY_MASK           (GPU_CORE_D2_STATUS_D2C_BUSY_ENUM | \
                                 GPU_CORE_D2_STATUS_D2C_BUSY_WRITE | \
                                 GPU_CORE_D2_STATUS_D2C_DLISTACTIVE)

#define GPU_IRQ_ENABLE          (GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_ENUM | \
                                 GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_BUS_ERROR)
#define GPU_IRQ_CLEAR           (GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_ENUM | \
                                 GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_BUS_ERROR)

/* 16.16 fixed point one */

#define GPU_FIX16_ONE           0x00010000

/* Source over destination: source factor alpha, destination factor
 * one minus alpha.  The alpha is the primitive alpha (COLOR1 for fills)
 * times the texel alpha times the COLOR2 alpha for textured boxes.
 */

#define GPU_BLEND_SRC_OVER      (GPU_CORE_D2_CONTROL2_D2C_BSF | \
                                 GPU_CORE_D2_CONTROL2_D2C_BDF | \
                                 GPU_CORE_D2_CONTROL2_D2C_BDI)

/* Burst length limit: 8 words on every master interface */

#define GPU_CONTROL3_BURST8     (GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBR(3) | \
                                 GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBW(3) | \
                                 GPU_CORE_D2_CONTROL3_BURSTLENGTH_MTX(3)  | \
                                 GPU_CORE_D2_CONTROL3_BURSTLENGTH_MDL(3))

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct da1470x_gpu_s
{
  mutex_t lock;          /* One render at a time */
  sem_t   done;          /* Render completion */
  bool    initialized;
  bool    buserror;      /* Bus error reported by the last render */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int gpu_ioctl(struct file *filep, int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct da1470x_gpu_s g_gpu =
{
  .lock = NXMUTEX_INITIALIZER,
  .done = SEM_INITIALIZER(0),
};

static const struct file_operations g_gpu_fops =
{
  NULL,        /* open */
  NULL,        /* close */
  NULL,        /* read */
  NULL,        /* write */
  NULL,        /* seek */
  gpu_ioctl,   /* ioctl */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gpu_putreg
 ****************************************************************************/

static inline void gpu_putreg(uint32_t offset, uint32_t value)
{
  putreg32(value, DA1470X_GPU_CORE_BASE + offset);
}

/****************************************************************************
 * Name: gpu_bpp
 *
 * Description:
 *   Bytes per pixel of a GPU pixel format, 0 if unsupported.
 *
 ****************************************************************************/

