AlmAck/nuttx/arch/arm/src/da1470x/da1470x_gpu.c
static unsigned int gpu_bpp(uint8_t format)
{
  switch (format)
    {
      case DA1470X_GPU_FMT_ALPHA8:
        return 1;

      case DA1470X_GPU_FMT_RGB565:
      case DA1470X_GPU_FMT_ARGB4444:
      case DA1470X_GPU_FMT_ARGB1555:
      case DA1470X_GPU_FMT_RGBA4444:
        return 2;

      case DA1470X_GPU_FMT_ARGB8888:
      case DA1470X_GPU_FMT_RGBA8888:
        return 4;

      default:
        return 0;
    }
}

/****************************************************************************
 * Name: gpu_has_alpha
 ****************************************************************************/

static bool gpu_has_alpha(uint8_t format)
{
  return format != DA1470X_GPU_FMT_RGB565;
}

/****************************************************************************
 * Name: gpu_writeformat / gpu_readformat
 *
 * Description:
 *   Encode a format into the scattered D2_CONTROL2 descriptor bits.
 *
 ****************************************************************************/

static uint32_t gpu_writeformat(uint8_t format)
{
  uint32_t bits = 0;

  if ((format & 1) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT1;
    }

  if ((format & 2) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT2;
    }

  if ((format & 4) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT3;
    }

  return bits;
}

static uint32_t gpu_readformat(uint8_t format)
{
  uint32_t bits = 0;

  if ((format & 1) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_READFORMAT1;
    }

  if ((format & 2) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_READFORMAT2;
    }

  if ((format & 4) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_READFORMAT3;
    }

  if ((format & 8) != 0)
    {
      bits |= GPU_CORE_D2_CONTROL2_D2C_READFORMAT4;
    }

  return bits;
}

/****************************************************************************
 * Name: gpu_check_rect
 *
 * Description:
 *   Validate that a rectangle lies inside a surface.
 *
 ****************************************************************************/

static uintptr_t gpu_bus_addr(uintptr_t addr)
{
  if (addr < GPU_FLASH_CPU_WINDOW)
    {
      uint32_t regval = getreg32(DA1470X_CACHE_FLASH);
      uint32_t base;
      uint32_t offset;

      base   = (regval & CACHE_FLASH_FLASH_REGION_BASE_MASK) >>
               CACHE_FLASH_FLASH_REGION_BASE_SHIFT;
      offset = (regval & CACHE_FLASH_FLASH_REGION_OFFSET_MASK) >>
               CACHE_FLASH_FLASH_REGION_OFFSET_SHIFT;

      return addr + (base << 16) + (offset << 2) + GPU_FLASH_BUS_OFFSET;
    }

  return addr;
}

static bool gpu_check_rect(const struct da1470x_gpu_surface_s *s,
                           uint16_t x, uint16_t y, uint16_t w, uint16_t h)
{
  if (s->addr == 0 || gpu_bpp(s->format) == 0 || s->pitch < s->width)
    {
      return false;
    }

  if (w == 0 || h == 0 || (uint32_t)x + w > s->width ||
      (uint32_t)y + h > s->height)
    {
      return false;
    }

  return true;
}

/****************************************************************************
 * Name: gpu_interrupt
 ****************************************************************************/

static int gpu_interrupt(int irq, void *context, void *arg)
{
  struct da1470x_gpu_s *priv = (struct da1470x_gpu_s *)arg;
  uint32_t status = getreg32(DA1470X_GPU_CORE_D2_STATUS);

  if ((status & GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR) != 0)
    {
      priv->buserror = true;
    }

  if ((status & (GPU_CORE_D2_STATUS_D2C_IRQ_ENUM |
                 GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR)) != 0)
    {
      /* Clear and keep enabled */

      gpu_putreg(DA1470X_GPU_CORE_D2_IRQCTL_OFFSET,
                 GPU_IRQ_ENABLE | GPU_IRQ_CLEAR);
      nxsem_post(&priv->done);
    }

  return OK;
}

/****************************************************************************
 * Name: gpu_wait_idle
 *
 * Description:
 *   Spin until the enumeration and write-back units are idle.
 *
 ****************************************************************************/

static int gpu_wait_idle(void)
{
  int i;

  for (i = 0; i < GPU_IDLE_LOOPS; i++)
    {
      if ((getreg32(DA1470X_GPU_CORE_D2_STATUS) & GPU_BUSY_MASK) == 0)
        {
          return OK;
        }
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: gpu_setup
 *
 * Description:
 *   Static core configuration: burst limits, no caches (frame buffers
 *   are read by the LCDC right after a render and sources are rewritten
 *   by the CPU between renders), interrupts on enumeration end and bus
 *   error.
 *
 ****************************************************************************/

static void gpu_setup(void)
{
  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL3_OFFSET, GPU_CONTROL3_BURST8);
  gpu_putreg(DA1470X_GPU_CORE_D2_CACHECTL_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_IRQCTL_OFFSET,
             GPU_IRQ_ENABLE | GPU_IRQ_CLEAR);
}

/****************************************************************************
 * Name: gpu_reset
 *
 * Description:
 *   A bus error or a hung enumeration leaves the core busy for good.
 *   Cycle its enable to start over.
 *
 ****************************************************************************/

static void gpu_reset(void)
{
  modifyreg32(DA1470X_GPU_REG_GPU_CTRL, GPU_REG_GPU_CTRL_GPU_EN, 0);
  up_udelay(10);
  modifyreg32(DA1470X_GPU_REG_GPU_CTRL, 0, GPU_REG_GPU_CTRL_GPU_EN);
  gpu_setup();
}

/****************************************************************************
 * Name: gpu_render
 *
 * Description:
 *   Program the frame buffer target, kick the render by writing the
 *   origin and wait for the enumeration to finish.  The lock must be held.
 *
 ****************************************************************************/

static int gpu_render(struct da1470x_gpu_s *priv,
                      const struct da1470x_gpu_surface_s *dst,
                      uint16_t x, uint16_t y, uint16_t w, uint16_t h)
{
  uintptr_t origin;
  int ret;

  ret = gpu_wait_idle();
  if (ret < 0)
    {
      gerr("GPU busy before render, resetting\n");
      gpu_reset();
      return ret;
    }

  origin = gpu_bus_addr(dst->addr) +
           ((uintptr_t)y * dst->pitch + x) * gpu_bpp(dst->format);

  priv->buserror = false;

  /* Drain any stale completion */

  while (nxsem_trywait(&priv->done) == OK)
    {
    }

  gpu_putreg(DA1470X_GPU_CORE_D2_PITCH_OFFSET, dst->pitch);
  gpu_putreg(DA1470X_GPU_CORE_D2_SIZE_OFFSET, ((uint32_t)h << 16) | w);
  gpu_putreg(DA1470X_GPU_CORE_D2_ORIGIN_OFFSET, (uint32_t)origin);

