AlmAck/nuttx/arch/arm/src/da1470x/da1470x_gpu.c
  ret = nxsem_tickwait_uninterruptible(&priv->done,
                                       MSEC2TICK(GPU_TIMEOUT_MS));
  if (ret < 0)
    {
      gerr("GPU render timed out, status %08" PRIx32 "\n",
           getreg32(DA1470X_GPU_CORE_D2_STATUS));
      gpu_reset();
      return ret;
    }

  if (priv->buserror)
    {
      gerr("GPU bus error\n");
      gpu_reset();
      return -EIO;
    }

  ret = gpu_wait_idle();
  if (ret < 0)
    {
      gpu_reset();
    }

  return ret;
}

/****************************************************************************
 * Name: gpu_ioctl
 ****************************************************************************/

static int gpu_ioctl(struct file *filep, int cmd, unsigned long arg)
{
  int ret;

  switch (cmd)
    {
      case GPUIOC_REVISION:
        {
          uint32_t *rev = (uint32_t *)arg;

          if (rev == NULL)
            {
              return -EINVAL;
            }

          *rev = da1470x_gpu_revision();
          ret  = OK;
        }
        break;

      case GPUIOC_FILL:
        ret = da1470x_gpu_fill((const struct da1470x_gpu_fill_s *)arg);
        break;

      case GPUIOC_BLIT:
        ret = da1470x_gpu_blit((const struct da1470x_gpu_blit_s *)arg);
        break;

      case GPUIOC_TEXBOX:
        ret = da1470x_gpu_texbox((const struct da1470x_gpu_texbox_s *)arg);
        break;

      case GPUIOC_WAIT:
        ret = nxmutex_lock(&g_gpu.lock);
        if (ret == OK)
          {
            ret = gpu_wait_idle();
            nxmutex_unlock(&g_gpu.lock);
          }
        break;

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_gpu_initialize
 ****************************************************************************/

int da1470x_gpu_initialize(void)
{
  struct da1470x_gpu_s *priv = &g_gpu;
  int ret;

  if (priv->initialized)
    {
      return OK;
    }

  ret = da1470x_pd_enable(DA1470X_PD_GPU);
  if (ret < 0)
    {
      return ret;
    }

  modifyreg32(DA1470X_CRG_GPU_CLK_GPU, 0, CRG_GPU_CLK_GPU_GPU_ENABLE);
  modifyreg32(DA1470X_GPU_REG_GPU_CTRL, 0, GPU_REG_GPU_CTRL_GPU_EN);

  if (da1470x_gpu_revision() == 0 || da1470x_gpu_revision() == 0xffffffff)
    {
      gerr("GPU does not answer\n");
      return -ENODEV;
    }

  irq_attach(DA1470X_IRQ_GPU, gpu_interrupt, priv);
  up_enable_irq(DA1470X_IRQ_GPU);
  gpu_setup();

  priv->initialized = true;
  return OK;
}

/****************************************************************************
 * Name: da1470x_gpu_revision
 ****************************************************************************/

uint32_t da1470x_gpu_revision(void)
{
  return getreg32(DA1470X_GPU_CORE_D2_HWREVISION);
}

/****************************************************************************
 * Name: gpu_texture_setup
 *
 * Description:
 *   Common part of the textured operations: formats, blend factors,
 *   opacity, and the texture base, pitch and size.
 *
 ****************************************************************************/

static void gpu_texture_setup(const struct da1470x_gpu_surface_s *src,
                              const struct da1470x_gpu_surface_s *dst,
                              uintptr_t texorigin, uint8_t alpha,
                              bool filter)
{
  uint32_t control2;

  control2 = gpu_writeformat(dst->format) |
             gpu_readformat(src->format) |
             GPU_CORE_D2_CONTROL2_D2C_TEXTUREENABLE |
             GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPX |
             GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPY |
             GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA1 |
             GPU_BLEND_SRC_OVER;

  if (filter)
    {
      control2 |= GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERX |
                  GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERY;
    }

  /* The fragment alpha is texel_alpha * COLOR2.alpha +
   * (1 - texel_alpha) * COLOR1.alpha.  A source with an alpha channel
   * gets its alpha scaled by the opacity; one without reports a texel
   * alpha of zero and takes the opacity from COLOR1.
   */

  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL2_OFFSET, control2);
  gpu_putreg(DA1470X_GPU_CORE_D2_COLOR1_OFFSET,
             gpu_has_alpha(src->format) ? 0 : (uint32_t)alpha << 24);
  gpu_putreg(DA1470X_GPU_CORE_D2_COLOR2_OFFSET,
             ((uint32_t)alpha << 24) | 0x00ffffff);

  gpu_putreg(DA1470X_GPU_CORE_D2_TEXORIGIN_OFFSET, (uint32_t)texorigin);
  gpu_putreg(DA1470X_GPU_CORE_D2_TEXPITCH_OFFSET, src->pitch);
  /* TEXMASK masks the linear texel offset (v * pitch + u), which only
   * describes a texture whose pitch is 2048; leave it open and keep the
   * samples inside the source by construction.
   */

  gpu_putreg(DA1470X_GPU_CORE_D2_TEXMASK_OFFSET, 0xffffffff);
}

/****************************************************************************
 * Name: da1470x_gpu_fill
 *
 * Description:
 *   Solid rectangle: no limiters (every pixel of the bounding box is
 *   inside), colour from D2_COLOR1, source factor one and destination
 *   factor zero so the pixel is replaced.
 *
 ****************************************************************************/

int da1470x_gpu_fill(const struct da1470x_gpu_fill_s *op)
{
  struct da1470x_gpu_s *priv = &g_gpu;
  uint32_t control2;
  int ret;

  if (op == NULL || !priv->initialized ||
      !gpu_check_rect(&op->dst, op->x, op->y, op->w, op->h))
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  control2 = gpu_writeformat(op->dst.format) |
             GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA1 |
             GPU_BLEND_SRC_OVER;

  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL2_OFFSET, control2);
  gpu_putreg(DA1470X_GPU_CORE_D2_COLOR1_OFFSET, op->color);
  gpu_putreg(DA1470X_GPU_CORE_D2_COLOR2_OFFSET, op->color);

  ret = gpu_render(priv, &op->dst, op->x, op->y, op->w, op->h);

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: da1470x_gpu_blit
 *
 * Description:
 *   Rectangle copy: the texture unit samples the source with the U and V
 *   limiters stepping one texel per pixel, clamped to the rectangle, and
 *   COLOR1 = 0 / COLOR2 = 1 leave the texel colour unchanged.
 *
 ****************************************************************************/

