AlmAck/nuttx/arch/arm/src/da1470x/da1470x_gpu.c
int da1470x_gpu_blit(const struct da1470x_gpu_blit_s *op)
{
  struct da1470x_gpu_s *priv = &g_gpu;
  uintptr_t texorigin;
  int ret;

  if (op == NULL || !priv->initialized ||
      !gpu_check_rect(&op->src, op->sx, op->sy, op->w, op->h) ||
      !gpu_check_rect(&op->dst, op->dx, op->dy, op->w, op->h))
    {
      return -EINVAL;
    }

  if (op->alpha == 0)
    {
      return OK;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  texorigin = gpu_bus_addr(op->src.addr) +
              ((uintptr_t)op->sy * op->src.pitch + op->sx) *
              gpu_bpp(op->src.format);

  gpu_texture_setup(&op->src, &op->dst, texorigin, op->alpha, false);

  /* U runs along x, V along y, one texel per pixel.  The integer parts
   * of V are in texels, i.e. rows times the pitch.
   */

  gpu_putreg(DA1470X_GPU_CORE_D2_LUSTART_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_LUXADD_OFFSET, GPU_FIX16_ONE);
  gpu_putreg(DA1470X_GPU_CORE_D2_LUYADD_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVSTARTI_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVSTARTF_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVXADDI_OFFSET, 0);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVYADDI_OFFSET, op->src.pitch);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVYXADDF_OFFSET, 0);

  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL_OFFSET, 0);
  ret = gpu_render(priv, &op->dst, op->dx, op->dy, op->w, op->h);
  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: da1470x_gpu_texbox
 *
 * Description:
 *   Texture-mapped box with an affine mapping and optional limiters:
 *   rotations, scalings, and the source alpha blended by the opacity.
 *   The texel sampled for a pixel is (floor(u), floor(v)); the V mapping
 *   is programmed with its integer part in texels (rows times the pitch)
 *   and its fraction in rows, as the core expects.
 *
 ****************************************************************************/

int da1470x_gpu_texbox(const struct da1470x_gpu_texbox_s *op)
{
  struct da1470x_gpu_s *priv = &g_gpu;
  uint32_t control = 0;
  int32_t ustart;
  int32_t vstart;
  int32_t vint;
  int32_t xint;
  int32_t yint;
  int ret;
  int i;

  if (op == NULL || !priv->initialized ||
      op->src.addr == 0 || gpu_bpp(op->src.format) == 0 ||
      op->src.pitch < op->src.width || op->src.width == 0 ||
      op->src.height == 0 || op->nlimiters > DA1470X_GPU_MAX_LIMITERS ||
      !gpu_check_rect(&op->dst, op->x, op->y, op->w, op->h))
    {
      return -EINVAL;
    }

  if (op->alpha == 0)
    {
      return OK;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  gpu_texture_setup(&op->src, &op->dst, gpu_bus_addr(op->src.addr),
                    op->alpha, op->filter != 0);

  ustart = op->ustart;
  vstart = op->vstart;

  gpu_putreg(DA1470X_GPU_CORE_D2_LUSTART_OFFSET, (uint32_t)ustart);
  gpu_putreg(DA1470X_GPU_CORE_D2_LUXADD_OFFSET, (uint32_t)op->uxadd);
  gpu_putreg(DA1470X_GPU_CORE_D2_LUYADD_OFFSET, (uint32_t)op->uyadd);

  vint = vstart >> 16;
  xint = op->vxadd >> 16;
  yint = op->vyadd >> 16;
  gpu_putreg(DA1470X_GPU_CORE_D2_LVSTARTI_OFFSET,
             (uint32_t)(vint * (int32_t)op->src.pitch));
  gpu_putreg(DA1470X_GPU_CORE_D2_LVSTARTF_OFFSET,
             (uint32_t)vstart & 0xffff);
  gpu_putreg(DA1470X_GPU_CORE_D2_LVXADDI_OFFSET,
             (uint32_t)(xint * (int32_t)op->src.pitch));
  gpu_putreg(DA1470X_GPU_CORE_D2_LVYADDI_OFFSET,
             (uint32_t)(yint * (int32_t)op->src.pitch));
  gpu_putreg(DA1470X_GPU_CORE_D2_LVYXADDF_OFFSET,
             (((uint32_t)op->vyadd & 0xffff) << 16) |
             ((uint32_t)op->vxadd & 0xffff));

  for (i = 0; i < op->nlimiters; i++)
    {
      gpu_putreg(DA1470X_GPU_CORE_D2_L1START_OFFSET + 4 * i,
                 (uint32_t)op->lim[i].start);
      gpu_putreg(DA1470X_GPU_CORE_D2_L1XADD_OFFSET + 4 * i,
                 (uint32_t)op->lim[i].xadd);
      gpu_putreg(DA1470X_GPU_CORE_D2_L1YADD_OFFSET + 4 * i,
                 (uint32_t)op->lim[i].yadd);
      control |= GPU_CORE_D2_CONTROL_D2C_LIM1ENABLE << i;
    }

  gpu_putreg(DA1470X_GPU_CORE_D2_CONTROL_OFFSET, control);
  ret = gpu_render(priv, &op->dst, op->x, op->y, op->w, op->h);
  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: da1470x_gpu_register
 ****************************************************************************/

int da1470x_gpu_register(const char *devpath)
{
  int ret = da1470x_gpu_initialize();

  if (ret < 0)
    {
      return ret;
    }

  return register_driver(devpath, &g_gpu_fops, 0666, &g_gpu);
}

#endif /* CONFIG_DA1470X_GPU */
